## test excel report export creator

In [11]:
import pandas as pd
import numpy as np

In [32]:
# read in test data
# TODO: replace with queryset from django
df = pd.read_csv("test.csv")

df

,id,staff_id,first_name,last_name,branch_name,task_name,punch_time_in,punch_time_out,session_time_hours
0,1112016-01-02 08:00:00,9997,TEST_FIRST_NAME_1,TEST_LAST_NAME_1,TEST_BRANCH_1,TEST_TASK_1,2016-01-02 08:00:00,2016-01-02 11:00:00,3.0
1,1232016-01-03 11:00:00,9997,TEST_FIRST_NAME_1,TEST_LAST_NAME_1,TEST_BRANCH_2,TEST_TASK_3,2016-01-03 11:00:00,2016-01-03 12:00:00,1.0
2,2122016-01-03 10:00:00,9998,TEST_FIRST_NAME_2,TEST_LAST_NAME_2,TEST_BRANCH_1,TEST_TASK_2,2016-01-03 10:00:00,2016-01-03 12:00:00,2.0
3,3112016-01-04 09:00:00,9999,TEST_FIRST_NAME_3,TEST_LAST_NAME_3,TEST_BRANCH_1,TEST_TASK_1,2016-01-04 09:00:00,NaN,NaN

In [39]:
# clean up data types
df.punch_time_in = pd.to_datetime(df.punch_time_in)
df.punch_time_out = pd.to_datetime(df.punch_time_out)

print df.dtypes
df

id                            object
staff_id                       int64
first_name                    object
last_name                     object
branch_name                   object
task_name                     object
punch_time_in         datetime64[ns]
punch_time_out        datetime64[ns]
session_time_hours           float64
dtype: object

,id,staff_id,first_name,last_name,branch_name,task_name,punch_time_in,punch_time_out,session_time_hours
0,1112016-01-02 08:00:00,9997,TEST_FIRST_NAME_1,TEST_LAST_NAME_1,TEST_BRANCH_1,TEST_TASK_1,2016-01-02 08:00:00,2016-01-02 11:00:00,3.0
1,1232016-01-03 11:00:00,9997,TEST_FIRST_NAME_1,TEST_LAST_NAME_1,TEST_BRANCH_2,TEST_TASK_3,2016-01-03 11:00:00,2016-01-03 12:00:00,1.0
2,2122016-01-03 10:00:00,9998,TEST_FIRST_NAME_2,TEST_LAST_NAME_2,TEST_BRANCH_1,TEST_TASK_2,2016-01-03 10:00:00,2016-01-03 12:00:00,2.0
3,3112016-01-04 09:00:00,9999,TEST_FIRST_NAME_3,TEST_LAST_NAME_3,TEST_BRANCH_1,TEST_TASK_1,2016-01-04 09:00:00,NaT,NaN

In [44]:
# create new columns
df['volunteer_name'] = df.last_name + ", " + df.first_name
df['month'] = df['punch_time_in'].dt.month
df['year'] = df['punch_time_in'].dt.year

df

,id,staff_id,first_name,last_name,branch_name,task_name,punch_time_in,punch_time_out,session_time_hours,month,year,volunteer_name
0,1112016-01-02 08:00:00,9997,TEST_FIRST_NAME_1,TEST_LAST_NAME_1,TEST_BRANCH_1,TEST_TASK_1,2016-01-02 08:00:00,2016-01-02 11:00:00,3.0,1,2016,"TEST_LAST_NAME_1, TEST_FIRST_NAME_1"
1,1232016-01-03 11:00:00,9997,TEST_FIRST_NAME_1,TEST_LAST_NAME_1,TEST_BRANCH_2,TEST_TASK_3,2016-01-03 11:00:00,2016-01-03 12:00:00,1.0,1,2016,"TEST_LAST_NAME_1, TEST_FIRST_NAME_1"
2,2122016-01-03 10:00:00,9998,TEST_FIRST_NAME_2,TEST_LAST_NAME_2,TEST_BRANCH_1,TEST_TASK_2,2016-01-03 10:00:00,2016-01-03 12:00:00,2.0,1,2016,"TEST_LAST_NAME_2, TEST_FIRST_NAME_2"
3,3112016-01-04 09:00:00,9999,TEST_FIRST_NAME_3,TEST_LAST_NAME_3,TEST_BRANCH_1,TEST_TASK_1,2016-01-04 09:00:00,NaT,NaN,1,2016,"TEST_LAST_NAME_3, TEST_FIRST_NAME_3"

In [45]:
grouped = df.groupby(['year','month','volunteer_name'])
volunteer = grouped.agg({'punch_time_in' : 'count', 'session_time_hours' : 'sum'})
volunteer.columns = ['Volunteer Sessions', 'Total Hours']
volunteer

                                                Volunteer Sessions  \
year month volunteer_name
2016 1     TEST_LAST_NAME_1, TEST_FIRST_NAME_1                   2
           TEST_LAST_NAME_2, TEST_FIRST_NAME_2                   1
           TEST_LAST_NAME_3, TEST_FIRST_NAME_3                   1

                                                Total Hours
year month volunteer_name
2016 1     TEST_LAST_NAME_1, TEST_FIRST_NAME_1          4.0
           TEST_LAST_NAME_2, TEST_FIRST_NAME_2          2.0
           TEST_LAST_NAME_3, TEST_FIRST_NAME_3          NaN

In [47]:
grouped = df.groupby(['year','month','task_name'])
task = grouped.agg({'punch_time_in' : 'count', 'session_time_hours' : 'sum'})
task.columns = ['Volunteer Sessions', 'Total Hours']
task

                        Volunteer Sessions  Total Hours
year month task_name
2016 1     TEST_TASK_1                   2          3.0
           TEST_TASK_2                   1          2.0
           TEST_TASK_3                   1          1.0

In [46]:
grouped = df.groupby(['year','month','volunteer_name', 'task_name'])
volunteer_task = grouped.agg({'punch_time_in' : 'count', 'session_time_hours' : 'sum'})
volunteer_task.columns = ['Volunteer Sessions', 'Total Hours']
volunteer_task

                                                            Volunteer Sessions  \
year month volunteer_name                      task_name
2016 1     TEST_LAST_NAME_1, TEST_FIRST_NAME_1 TEST_TASK_1                   1
                                               TEST_TASK_3                   1
           TEST_LAST_NAME_2, TEST_FIRST_NAME_2 TEST_TASK_2                   1
           TEST_LAST_NAME_3, TEST_FIRST_NAME_3 TEST_TASK_1                   1

                                                            Total Hours
year month volunteer_name                      task_name
2016 1     TEST_LAST_NAME_1, TEST_FIRST_NAME_1 TEST_TASK_1          3.0
                                               TEST_TASK_3          1.0
           TEST_LAST_NAME_2, TEST_FIRST_NAME_2 TEST_TASK_2          2.0
           TEST_LAST_NAME_3, TEST_FIRST_NAME_3 TEST_TASK_1          NaN